index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-01 Tue 07:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reimplementing a deep network architecture for single-image rain removal</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jonathan Jin" />
<!-- Global site tag (gtag.js) - Google Analytics -->
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Reimplementing a deep network architecture for single-image rain removal</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd8cef3d">1. Abstract</a></li>
<li><a href="#org6f97c63">2. <span class="todo TODO">TODO</span> <code>[1/2]</code> Development</a>
<ul>
<li><a href="#org0631051">2.1. Preamble</a></li>
<li><a href="#org37a38cb">2.2. <span class="done DONE">DONE</span> Data importing and preparation</a></li>
<li><a href="#org123dbb7">2.3. <span class="todo TODO">TODO</span> Model Training</a></li>
</ul>
</li>
<li><a href="#orge62a45b">3. References</a></li>
<li><a href="#org4548799">4. Appendix</a>
<ul>
<li><a href="#org76f4d3f">4.1. The Dataset</a></li>
<li><a href="#org6604783">4.2. The Report</a></li>
<li><a href="#org16588d6">4.3. The Site</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd8cef3d" class="outline-2">
<h2 id="orgd8cef3d"><span class="section-number-2">1</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<p>
We present a re-implementation of the <a href="https://arxiv.org/pdf/1609.02087v2.pdf">DerainNet method for single-image rain
removal</a> in the <a href="https://www-cs-faculty.stanford.edu/~knuth/lp.html">literate programming</a> style. Our approach here deviates slightly
from the authors&rsquo; implementation in a variety of ways, most notably of which
is the use of <a href="https://www.tensorflow.org">TensorFlow</a> for all stages in the workflow: data preparation;
model definition; model training; and so on.
</p>
</div>
</div>

<div id="outline-container-org6f97c63" class="outline-2">
<h2 id="org6f97c63"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> <code>[1/2]</code> Development</h2>
<div class="outline-text-2" id="text-2">
<p>
We&rsquo;ll split the development process roughly into the following stages:
</p>

<ul class="org-ul">
<li>Data importing/preparation;</li>
<li>Model training.</li>
</ul>
</div>

<div id="outline-container-org0631051" class="outline-3">
<h3 id="org0631051"><span class="section-number-3">2.1</span> Preamble</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-bash">virtualenv --system-site-packages -p $(<span style="color: #81A1C1;">which</span> python3) env3
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(pyvenv-activate <span style="color: #A3BE8C;">"./env3"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org37a38cb" class="outline-3">
<h3 id="org37a38cb"><span class="section-number-3">2.2</span> <span class="done DONE">DONE</span> Data importing and preparation</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">import</span> glob
<span style="color: #81A1C1;">import</span> os
<span style="color: #81A1C1;">import</span> tensorflow <span style="color: #81A1C1;">as</span> tf
</pre>
</div>

<p>
The dataset directory is organized into two folders:
</p>

<ul class="org-ul">
<li><code>ground truth</code> images; and</li>
<li><code>rainy</code> images.</li>
</ul>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #D8DEE9;">GROUND_TRUTH_DIR</span> = <span style="color: #A3BE8C;">"ground truth"</span>
<span style="color: #D8DEE9;">RAINY_IMAGE_DIR</span> = <span style="color: #A3BE8C;">"rainy image"</span>
</pre>
</div>

<p>
These correspond to our model&rsquo;s expected outputs, as well as the inputs,
respectively. Likewise, each &ldquo;ground truth&rdquo; image corresponds to one or more
&ldquo;rainy&rdquo; images according to some &ldquo;index&rdquo; value &#x2013; <code>ground truth/1.jpg</code> to
<code>rainy image/1_{1,2,3}.jpg</code>, <code>ground truth/100.jpg</code> to <code>rainy
   image/100_{1,2,3,4,5}</code>, and so on.
</p>

<p>
With this topology in mind, we can define a function to retrieve all index
values within the data directory:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_get_indices</span>(data_dir):
    <span style="color: #4c566a;">"""Get indices for input/output association.</span>

<span style="color: #4c566a;">    Args:</span>
<span style="color: #4c566a;">    data_dir: Path to the data directory.</span>

<span style="color: #4c566a;">    Returns:</span>
<span style="color: #4c566a;">    indices: List of numerical index values.</span>

<span style="color: #4c566a;">    Raises:</span>
<span style="color: #4c566a;">    ValueError: If no data_dir or no ground-truth dir.</span>
<span style="color: #4c566a;">    """</span>

    <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> tf.gfile.Exists(os.path.join(data_dir, GROUND_TRUTH_DIR)):
        <span style="color: #81A1C1;">raise</span> <span style="color: #8FBCBB;">ValueError</span>(<span style="color: #A3BE8C;">"Failed to find ground-truth directory."</span>)

    <span style="color: #81A1C1;">return</span> [
        os.path.splitext(os.path.basename(f))[0]
        <span style="color: #81A1C1;">for</span> f <span style="color: #81A1C1;">in</span> glob.glob(os.path.join(data_dir, GROUND_TRUTH_DIR, <span style="color: #A3BE8C;">"*.jpg"</span>))
    ]
</pre>
</div>

<p>
Likewise, we can define functions to retrieve the filenames of all input and
output files corresponding to a given set of indices.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_get_input_files</span>(data_dir, indices):
    <span style="color: #4c566a;">"""Get input files from indices.</span>

<span style="color: #4c566a;">    Args:</span>
<span style="color: #4c566a;">    data_dir: Path to the data directory.</span>
<span style="color: #4c566a;">    indices: List of numerical index values.</span>

<span style="color: #4c566a;">    Returns:</span>
<span style="color: #4c566a;">    Dictionary, keyed by index value, valued by string lists containing</span>
<span style="color: #4c566a;">    one or more filenames.</span>

<span style="color: #4c566a;">    Raises:</span>
<span style="color: #4c566a;">    ValueError: If no rainy-image dir.</span>
<span style="color: #4c566a;">    """</span>

    <span style="color: #D8DEE9;">directory</span> = os.path.join(data_dir, RAINY_IMAGE_DIR)
    <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> tf.gfile.Exists(directory):
        <span style="color: #81A1C1;">raise</span> <span style="color: #8FBCBB;">ValueError</span>(<span style="color: #A3BE8C;">"Failed to find rainy-image directory."</span>)

    <span style="color: #81A1C1;">return</span> {
        i: glob.glob(os.path.join(directory, <span style="color: #A3BE8C;">"{}_[0-9]*.jpg"</span>.<span style="color: #81A1C1;">format</span>(i)))
        <span style="color: #81A1C1;">for</span> i <span style="color: #81A1C1;">in</span> indices
    }
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_get_output_files</span>(data_dir, indices):
    <span style="color: #4c566a;">"""Get output files from indices.</span>

<span style="color: #4c566a;">    Args:</span>
<span style="color: #4c566a;">    data_dir: Path to the data directory.</span>
<span style="color: #4c566a;">    indices: List of numerical index values.</span>

<span style="color: #4c566a;">    Returns:</span>
<span style="color: #4c566a;">    outputs: Dictionary, keyed by index value, valued by stsring lists</span>
<span style="color: #4c566a;">    containing one or more filenames.</span>

<span style="color: #4c566a;">    Raises:</span>
<span style="color: #4c566a;">    ValueError: If no ground-truth dir.</span>
<span style="color: #4c566a;">    """</span>

    <span style="color: #D8DEE9;">directory</span> = os.path.join(data_dir, GROUND_TRUTH_DIR)
    <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> tf.gfile.Exists(directory):
        <span style="color: #81A1C1;">raise</span> <span style="color: #8FBCBB;">ValueError</span>(<span style="color: #A3BE8C;">"Failed to find ground-truth directory."</span>)

    <span style="color: #81A1C1;">return</span> {
        i: os.path.join(directory, <span style="color: #A3BE8C;">"{}.jpg"</span>.<span style="color: #81A1C1;">format</span>(i)) <span style="color: #81A1C1;">for</span> i <span style="color: #81A1C1;">in</span> indices
    }
</pre>
</div>

<p>
Now we arrive at our first deviation from the author&rsquo;s implementation. The
authors, in their paper, don&rsquo;t seem to perform any standardized cropping on
their images, relying on the inputs to all be identical in resolution or, at
most, flipped, e.g. <code>384x512</code> and <code>512x384</code>. Here, to ease integration with
TensorFlow, we settle on a common length to truncate inputs and outputs by
along both dimensions.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #D8DEE9;">IMAGE_SIZE</span> = 384
</pre>
</div>

<p>
Finally, we have our canonical dataset-creation interface, concluding the
first part of our project.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">dataset</span>(data_dir, indices=<span style="color: #81A1C1;">None</span>):
    <span style="color: #4c566a;">"""Construct dataset for rainy-image evaluation.</span>

<span style="color: #4c566a;">    Args:</span>
<span style="color: #4c566a;">    data_dir: Path to the data directory.</span>
<span style="color: #4c566a;">    indices: The input-output pairings to return. If None (the default), uses</span>
<span style="color: #4c566a;">    indices present in the data directory.</span>

<span style="color: #4c566a;">    Returns:</span>
<span style="color: #4c566a;">    dataset: Dataset of input-output images.</span>
<span style="color: #4c566a;">    """</span>

    <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> indices:
        <span style="color: #D8DEE9;">indices</span> = _get_indices(data_dir)

    <span style="color: #D8DEE9;">fs_in</span> = _get_input_files(data_dir, indices)
    <span style="color: #D8DEE9;">fs_out</span> = _get_output_files(data_dir, indices)

    <span style="color: #D8DEE9;">ins</span> = [
        fname <span style="color: #81A1C1;">for</span> k, v <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">iter</span>(<span style="color: #81A1C1;">sorted</span>(fs_in.items()))
        <span style="color: #81A1C1;">for</span> fname <span style="color: #81A1C1;">in</span> v <span style="color: #81A1C1;">if</span> k <span style="color: #81A1C1;">in</span> indices
    ]

    <span style="color: #D8DEE9;">outs</span> = [v <span style="color: #81A1C1;">for</span> sublist <span style="color: #81A1C1;">in</span> [
        [fname] * <span style="color: #81A1C1;">len</span>(fs_in[k])
        <span style="color: #81A1C1;">for</span> k, fname <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">iter</span>(<span style="color: #81A1C1;">sorted</span>(fs_out.items()))
        <span style="color: #81A1C1;">if</span> k <span style="color: #81A1C1;">in</span> indices
    ] <span style="color: #81A1C1;">for</span> v <span style="color: #81A1C1;">in</span> sublist]

    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_parse_function</span>(fname_in, fname_out):
        <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_decode_resize</span>(fname):
            <span style="color: #81A1C1;">return</span> tf.image.resize_image_with_crop_or_pad(
                tf.image.decode_jpeg(fname), IMAGE_SIZE, IMAGE_SIZE,
            )

        <span style="color: #81A1C1;">return</span> _decode_resize(fname_in), _decode_resize(fname_out)

    <span style="color: #D8DEE9;">dataset</span> = tf.data.Dataset.from_tensor_slices(
        (tf.constant(ins), tf.constant(outs)),
    ).<span style="color: #81A1C1;">map</span>(_parse_function)

    <span style="color: #81A1C1;">return</span> dataset
</pre>
</div>
</div>
</div>

<div id="outline-container-org123dbb7" class="outline-3">
<h3 id="org123dbb7"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> Model Training</h3>
</div>
</div>
<div id="outline-container-orge62a45b" class="outline-2">
<h2 id="orge62a45b"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://smartdsp.xmu.edu.cn/derainNet.html">http://smartdsp.xmu.edu.cn/derainNet.html</a></li>

<li>X. Fu, J. Huang, D. Zeng, Y. Huang, X. Ding and J. Paisley. ¡°Removing Rain
from Single Images via a Deep Detail Network¡±, CVPR, 2017.</li>

<li>X. Fu, J. Huang, X. Ding, Y. Liao and J. Paisley. ¡°Clearing the Skies: A
deep network architecture for single-image rain removal¡±, IEEE Transactions
on Image Processing, vol. 26, no. 6, pp. 2944-2956, 2017.</li>
</ul>
</div>
</div>

<div id="outline-container-org4548799" class="outline-2">
<h2 id="org4548799"><span class="section-number-2">4</span> Appendix</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org76f4d3f" class="outline-3">
<h3 id="org76f4d3f"><span class="section-number-3">4.1</span> The Dataset</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The authors&rsquo; rainy image dataset can be found <a href="http://smartdsp.xmu.edu.cn/memberpdf/fuxueyang/cvpr2017/rainy_image_dataset.zip">here</a>. Unfortunately, that page
was, at the start of this project, unreliable at best; it is now, as of
04/28/2018, entirely unavailable. As such, at the start of this project, I
took the liberty of cloning the authors&rsquo; dataset; it is available at
<a href="https://github.com/jinnovation/rainy-image-dataset">github.com/jinnovation/rainy-image-dataset</a>.
</p>
</div>
</div>

<div id="outline-container-org6604783" class="outline-3">
<h3 id="org6604783"><span class="section-number-3">4.2</span> The Report</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This article is written with Emacs and <a href="https://orgmode.org/manual/HTML-export.html">Org mode</a> in the <a href="https://www-cs-faculty.stanford.edu/~knuth/lp.html">literate programming</a>
style. 
</p>
</div>
</div>

<div id="outline-container-org16588d6" class="outline-3">
<h3 id="org16588d6"><span class="section-number-3">4.3</span> The Site</h3>
<div class="outline-text-3" id="text-4-3">
<p>
This write-up is also available at <a href="https://jinnovation.github.io/derain-net">jinnovation.github.io/derain-net</a>. It is
generated using Org-mode&rsquo;s <a href="https://orgmode.org/manual/HTML-export.html">HTML export functionality</a>, as well as the
<a href="https://github.com/fniessen/org-html-themes">ReadTheOrg theme</a>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-04-28 Sat 00:00</p>
<p class="author">Author: Jonathan Jin</p>
<p class="date">Created: 2018-05-01 Tue 07:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
